# Задача 18: Требуется найти в массиве A[1..N] самый близкий по
# величине элемент к заданному числу X. Пользователь в первой строке
# вводит натуральное число N – количество элементов в массиве. В
# последующих строках записаны N целых чисел Ai
# . Последняя строка
# содержит число X

# 5
# 1 2 3 4 5

# 6
# -> 5

list_length = int(input('Введите длину списка: '))
number = int(input('Введите число: '))
list = []
total_number = 0



print(list_length)
print(list)
print(number)
print(total_number)